{
  "_class_name": "UNetMotionModel",
  "_diffusers_version": "0.30.0.dev0",
  "_name_or_path": "/home/dreamyou070/.cache/huggingface/hub/models--emilianJR--epiCRealism/snapshots/6522cf856b8c8e14638a0aaa7bd89b1b098aed17/unet",
  "act_fn": "silu",
  "addition_embed_type": null,
  "addition_embed_type_num_heads": 64,
  "addition_time_embed_dim": null,
  "attention_head_dim": 8,
  "block_out_channels": [
    320,
    640,
    1280,
    1280
  ],
  "center_input_sample": false,
  "class_embed_type": null,
  "class_embeddings_concat": false,
  "conv_in_kernel": 3,
  "conv_out_kernel": 3,
  "cross_attention_dim": 768,
  "cross_attention_norm": null,
  "down_block_types": [
    "CrossAttnDownBlockMotion",
    "CrossAttnDownBlockMotion",
    "CrossAttnDownBlockMotion",
    "DownBlockMotion"
  ],
  "downsample_padding": 1,
  "dual_cross_attention": false,
  "encoder_hid_dim": null,
  "encoder_hid_dim_type": null,
  "flip_sin_to_cos": true,
  "freq_shift": 0,
  "in_channels": 4,
  "layers_per_block": 2,
  "mid_block_only_cross_attention": null,
  "mid_block_scale_factor": 1,
  "mid_block_type": "UNetMidBlock2DCrossAttn",
  "motion_max_seq_length": 32,
  "motion_num_attention_heads": 8,
  "norm_eps": 1e-05,
  "norm_num_groups": 32,
  "num_attention_heads": 8,
  "num_class_embeds": null,
  "only_cross_attention": false,
  "out_channels": 4,
  "projection_class_embeddings_input_dim": null,
  "resnet_out_scale_factor": 1.0,
  "resnet_skip_time_act": false,
  "resnet_time_scale_shift": "default",
  "reverse_transformer_layers_per_block": null,
  "sample_size": 64,
  "time_cond_proj_dim": null,
  "time_embedding_act_fn": null,
  "time_embedding_dim": null,
  "time_embedding_type": "positional",
  "timestep_post_act": null,
  "transformer_layers_per_block": 1,
  "up_block_types": [
    "UpBlockMotion",
    "CrossAttnUpBlockMotion",
    "CrossAttnUpBlockMotion",
    "CrossAttnUpBlockMotion"
  ],
  "upcast_attention": false,
  "use_linear_projection": false,
  "use_motion_mid_block": true
}
