{
  "_class_name": "UNetMotionModel",
  "_diffusers_version": "0.30.0.dev0",
  "act_fn": "silu",
  "addition_embed_type": null,
  "addition_time_embed_dim": null,
  "block_out_channels": [
    320,
    640,
    1280,
    1280
  ],
  "cross_attention_dim": 768,
  "down_block_types": [
    "CrossAttnDownBlockMotion",
    "CrossAttnDownBlockMotion",
    "CrossAttnDownBlockMotion",
    "DownBlockMotion"
  ],
  "downsample_padding": 1,
  "encoder_hid_dim": null,
  "encoder_hid_dim_type": null,
  "in_channels": 4,
  "layers_per_block": 2,
  "mid_block_layers": 1,
  "mid_block_scale_factor": 1,
  "motion_max_seq_length": 32,
  "motion_num_attention_heads": 8,
  "norm_eps": 1e-05,
  "norm_num_groups": 32,
  "num_attention_heads": 8,
  "out_channels": 4,
  "projection_class_embeddings_input_dim": null,
  "reverse_motion_num_attention_heads": null,
  "reverse_temporal_transformer_layers_per_block": null,
  "reverse_transformer_layers_per_block": null,
  "sample_size": 64,
  "temporal_transformer_layers_per_block": 1,
  "temporal_transformer_layers_per_mid_block": 1,
  "time_cond_proj_dim": null,
  "transformer_layers_per_block": 1,
  "transformer_layers_per_mid_block": null,
  "up_block_types": [
    "UpBlockMotion",
    "CrossAttnUpBlockMotion",
    "CrossAttnUpBlockMotion",
    "CrossAttnUpBlockMotion"
  ],
  "use_linear_projection": false,
  "use_motion_mid_block": true
}
